{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "<s>": 1,
      "</s>": 2,
      "<pad>": 3,
      ",": 4,
      ".": 5,
      "1": 6,
      "2": 7,
      "3": 8,
      "4": 9,
      "5": 10,
      "7": 11,
      "8": 12,
      "9": 13,
      ":": 14,
      "?": 15,
      "A": 16,
      "C": 17,
      "F": 18,
      "I": 19,
      "M": 20,
      "P": 21,
      "Q": 22,
      "R": 23,
      "S": 24,
      "T": 25,
      "U": 26,
      "W": 27,
      "a": 28,
      "b": 29,
      "c": 30,
      "d": 31,
      "e": 32,
      "f": 33,
      "g": 34,
      "h": 35,
      "i": 36,
      "j": 37,
      "k": 38,
      "l": 39,
      "m": 40,
      "n": 41,
      "o": 42,
      "p": 43,
      "q": 44,
      "r": 45,
      "s": 46,
      "t": 47,
      "u": 48,
      "v": 49,
      "w": 50,
      "x": 51,
      "y": 52,
      "z": 53,
      "Ġ": 54,
      "Ġa": 55,
      "Ġt": 56,
      "es": 57,
      "er": 58,
      "he": 59,
      "in": 60,
      "on": 61,
      "te": 62,
      "Ġan": 63,
      "Ġthe": 64,
      "Ġand": 65,
      "Ġp": 66,
      "Ġr": 67,
      "Ġs": 68,
      "an": 69,
      "at": 70,
      "ain": 71,
      "ho": 72,
      "ic": 73,
      "ion": 74,
      "nc": 75,
      "ro": 76,
      "sw": 77,
      "tion": 78,
      "um": 79,
      "ves": 80,
      "wo": 81,
      "ĠA": 82,
      "ĠP": 83,
      "Ġf": 84,
      "Ġm": 85,
      "swer": 86,
      "Qu": 87,
      "as": 88,
      "de": 89,
      "em": 90,
      "ft": 91,
      "hat": 92,
      "is": 93,
      "ives": 94,
      "la": 95,
      "lt": 96,
      "num": 97,
      "nswer": 98,
      "pl": 99,
      "ur": 100,
      "ult": 101,
      "ve": 102,
      "Ġ1": 103,
      "Ġ5": 104,
      "Ġb": 105,
      "Ġc": 106,
      "Ġho": 107,
      "Ġnum": 108,
      "Ġat": 109,
      "Ġaft": 110,
      "Ġtwo": 111,
      "estion": 112,
      "esult": 113,
      "ing": 114,
      "tep": 115,
      "Ġpro": 116,
      "Ġresult": 117,
      "Ġstep": 118,
      "ĠAnswer": 119,
      "ĠPM": 120,
      "Question": 121,
      "Ġafter": 122,
      "23": 123,
      "42": 124,
      "Co": 125,
      "Fr": 126,
      "If": 127,
      "Re": 128,
      "So": 129,
      "Tr": 130,
      "The": 131,
      "Us": 132,
      "Wr": 133,
      "What": 134,
      "al": 135,
      "ay": 136,
      "aves": 137,
      "bl": 138,
      "ber": 139,
      "cis": 140,
      "dd": 141,
      "do": 142,
      "en": 143,
      "ex": 144,
      "ean": 145,
      "enc": 146,
      "eas": 147,
      "eaves": 148,
      "gives": 149,
      "hon": 150,
      "has": 151,
      "im": 152,
      "ite": 153,
      "ide": 154,
      "jum": 155,
      "lu": 156,
      "lic": 157,
      "lve": 158,
      "leaves": 159,
      "mp": 160,
      "ov": 161,
      "ox": 162,
      "ode": 163,
      "ps": 164,
      "ppl": 165,
      "qu": 166,
      "rd": 167,
      "rr": 168,
      "rt": 169,
      "res": 170,
      "rain": 171,
      "sla": 172,
      "to": 173,
      "tur": 174,
      "thon": 175,
      "ute": 176,
      "unc": 177,
      "vide": 178,
      "wn": 179,
      "way": 180,
      "ython": 181,
      "zy": 182,
      "Ġ3": 183,
      "Ġ7": 184,
      "Ġ8": 185,
      "Ġ9": 186,
      "Ġin": 187,
      "Ġwo": 188,
      "Ġis": 189,
      "Ġla": 190,
      "Ġ23": 191,
      "Ġ42": 192,
      "ĠFr": 193,
      "ĠIf": 194,
      "ĠWhat": 195,
      "Ġdo": 196,
      "Ġex": 197,
      "Ġgives": 198,
      "Ġhas": 199,
      "Ġjum": 200,
      "Ġleaves": 201,
      "Ġov": 202,
      "Ġqu": 203,
      "Ġadd": 204,
      "Ġappl": 205,
      "Ġarr": 206,
      "Ġaway": 207,
      "Ġthat": 208,
      "Ġtim": 209,
      "Ġtrain": 210,
      "eric": 211,
      "erve": 212,
      "inal": 213,
      "oning": 214,
      "oncis": 215,
      "tenc": 216,
      "Ġanswer": 217,
      "Ġplu": 218,
      "Ġpres": 219,
      "Ġrem": 220,
      "Ġreas": 221,
      "Ġsho": 222,
      "Ġsen": 223,
      "any": 224,
      "ansla": 225,
      "ath": 226,
      "ick": 227,
      "rown": 228,
      "ĠAlic": 229,
      "ĠPython": 230,
      "Ġfox": 231,
      "Ġfunc": 232,
      "Ġfinal": 233,
      "Ġmean": 234,
      "Ġmany": 235,
      "Ġmath": 236,
      "plain": 237,
      "urs": 238,
      "Ġ12": 239,
      "Ġ19": 240,
      "Ġby": 241,
      "Ġbrown": 242,
      "Ġcode": 243,
      "Ġconcis": 244,
      "Ġhow": 245,
      "Ġhours": 246,
      "Ġnumber": 247,
      "Ġnumeric": 248,
      "Ġprobl": 249,
      "Ġprovide": 250,
      "Comp": 251,
      "Retur": 252,
      "Solve": 253,
      "Transla": 254,
      "Use": 255,
      "Write": 256,
      "ench": 257,
      "Ġinto": 258,
      "Ġword": 259,
      "Ġlazy": 260,
      "ĠFrench": 261,
      "Ġdog": 262,
      "Ġexplain": 263,
      "Ġjumps": 264,
      "Ġover": 265,
      "Ġquick": 266,
      "Ġadds": 267,
      "Ġapples": 268,
      "Ġarrives": 269,
      "Ġtimes": 270,
      "tence": 271,
      "Ġplus": 272,
      "Ġpreserve": 273,
      "Ġremain": 274,
      "Ġreasoning": 275,
      "Ġshort": 276,
      "Ġsentence": 277,
      "ĠAlice": 278,
      "Ġfunction": 279,
      "Ġmeaning": 280,
      "Ġconcise": 281,
      "Ġnumbers": 282,
      "Ġproblem": 283,
      "Compute": 284,
      "Return": 285,
      "Translate": 286
    },
    "merges": [
      [
        "Ġ",
        "a"
      ],
      [
        "Ġ",
        "t"
      ],
      [
        "e",
        "s"
      ],
      [
        "e",
        "r"
      ],
      [
        "h",
        "e"
      ],
      [
        "i",
        "n"
      ],
      [
        "o",
        "n"
      ],
      [
        "t",
        "e"
      ],
      [
        "Ġa",
        "n"
      ],
      [
        "Ġt",
        "he"
      ],
      [
        "Ġan",
        "d"
      ],
      [
        "Ġ",
        "p"
      ],
      [
        "Ġ",
        "r"
      ],
      [
        "Ġ",
        "s"
      ],
      [
        "a",
        "n"
      ],
      [
        "a",
        "t"
      ],
      [
        "a",
        "in"
      ],
      [
        "h",
        "o"
      ],
      [
        "i",
        "c"
      ],
      [
        "i",
        "on"
      ],
      [
        "n",
        "c"
      ],
      [
        "r",
        "o"
      ],
      [
        "s",
        "w"
      ],
      [
        "t",
        "ion"
      ],
      [
        "u",
        "m"
      ],
      [
        "v",
        "es"
      ],
      [
        "w",
        "o"
      ],
      [
        "Ġ",
        "A"
      ],
      [
        "Ġ",
        "P"
      ],
      [
        "Ġ",
        "f"
      ],
      [
        "Ġ",
        "m"
      ],
      [
        "sw",
        "er"
      ],
      [
        "Q",
        "u"
      ],
      [
        "a",
        "s"
      ],
      [
        "d",
        "e"
      ],
      [
        "e",
        "m"
      ],
      [
        "f",
        "t"
      ],
      [
        "h",
        "at"
      ],
      [
        "i",
        "s"
      ],
      [
        "i",
        "ves"
      ],
      [
        "l",
        "a"
      ],
      [
        "l",
        "t"
      ],
      [
        "n",
        "um"
      ],
      [
        "n",
        "swer"
      ],
      [
        "p",
        "l"
      ],
      [
        "u",
        "r"
      ],
      [
        "u",
        "lt"
      ],
      [
        "v",
        "e"
      ],
      [
        "Ġ",
        "1"
      ],
      [
        "Ġ",
        "5"
      ],
      [
        "Ġ",
        "b"
      ],
      [
        "Ġ",
        "c"
      ],
      [
        "Ġ",
        "ho"
      ],
      [
        "Ġ",
        "num"
      ],
      [
        "Ġa",
        "t"
      ],
      [
        "Ġa",
        "ft"
      ],
      [
        "Ġt",
        "wo"
      ],
      [
        "es",
        "tion"
      ],
      [
        "es",
        "ult"
      ],
      [
        "in",
        "g"
      ],
      [
        "te",
        "p"
      ],
      [
        "Ġp",
        "ro"
      ],
      [
        "Ġr",
        "esult"
      ],
      [
        "Ġs",
        "tep"
      ],
      [
        "ĠA",
        "nswer"
      ],
      [
        "ĠP",
        "M"
      ],
      [
        "Qu",
        "estion"
      ],
      [
        "Ġaft",
        "er"
      ],
      [
        "2",
        "3"
      ],
      [
        "4",
        "2"
      ],
      [
        "C",
        "o"
      ],
      [
        "F",
        "r"
      ],
      [
        "I",
        "f"
      ],
      [
        "R",
        "e"
      ],
      [
        "S",
        "o"
      ],
      [
        "T",
        "r"
      ],
      [
        "T",
        "he"
      ],
      [
        "U",
        "s"
      ],
      [
        "W",
        "r"
      ],
      [
        "W",
        "hat"
      ],
      [
        "a",
        "l"
      ],
      [
        "a",
        "y"
      ],
      [
        "a",
        "ves"
      ],
      [
        "b",
        "l"
      ],
      [
        "b",
        "er"
      ],
      [
        "c",
        "is"
      ],
      [
        "d",
        "d"
      ],
      [
        "d",
        "o"
      ],
      [
        "e",
        "n"
      ],
      [
        "e",
        "x"
      ],
      [
        "e",
        "an"
      ],
      [
        "e",
        "nc"
      ],
      [
        "e",
        "as"
      ],
      [
        "e",
        "aves"
      ],
      [
        "g",
        "ives"
      ],
      [
        "h",
        "on"
      ],
      [
        "h",
        "as"
      ],
      [
        "i",
        "m"
      ],
      [
        "i",
        "te"
      ],
      [
        "i",
        "de"
      ],
      [
        "j",
        "um"
      ],
      [
        "l",
        "u"
      ],
      [
        "l",
        "ic"
      ],
      [
        "l",
        "ve"
      ],
      [
        "l",
        "eaves"
      ],
      [
        "m",
        "p"
      ],
      [
        "o",
        "v"
      ],
      [
        "o",
        "x"
      ],
      [
        "o",
        "de"
      ],
      [
        "p",
        "s"
      ],
      [
        "p",
        "pl"
      ],
      [
        "q",
        "u"
      ],
      [
        "r",
        "d"
      ],
      [
        "r",
        "r"
      ],
      [
        "r",
        "t"
      ],
      [
        "r",
        "es"
      ],
      [
        "r",
        "ain"
      ],
      [
        "s",
        "la"
      ],
      [
        "t",
        "o"
      ],
      [
        "t",
        "ur"
      ],
      [
        "t",
        "hon"
      ],
      [
        "u",
        "te"
      ],
      [
        "u",
        "nc"
      ],
      [
        "v",
        "ide"
      ],
      [
        "w",
        "n"
      ],
      [
        "w",
        "ay"
      ],
      [
        "y",
        "thon"
      ],
      [
        "z",
        "y"
      ],
      [
        "Ġ",
        "3"
      ],
      [
        "Ġ",
        "7"
      ],
      [
        "Ġ",
        "8"
      ],
      [
        "Ġ",
        "9"
      ],
      [
        "Ġ",
        "in"
      ],
      [
        "Ġ",
        "wo"
      ],
      [
        "Ġ",
        "is"
      ],
      [
        "Ġ",
        "la"
      ],
      [
        "Ġ",
        "23"
      ],
      [
        "Ġ",
        "42"
      ],
      [
        "Ġ",
        "Fr"
      ],
      [
        "Ġ",
        "If"
      ],
      [
        "Ġ",
        "What"
      ],
      [
        "Ġ",
        "do"
      ],
      [
        "Ġ",
        "ex"
      ],
      [
        "Ġ",
        "gives"
      ],
      [
        "Ġ",
        "has"
      ],
      [
        "Ġ",
        "jum"
      ],
      [
        "Ġ",
        "leaves"
      ],
      [
        "Ġ",
        "ov"
      ],
      [
        "Ġ",
        "qu"
      ],
      [
        "Ġa",
        "dd"
      ],
      [
        "Ġa",
        "ppl"
      ],
      [
        "Ġa",
        "rr"
      ],
      [
        "Ġa",
        "way"
      ],
      [
        "Ġt",
        "hat"
      ],
      [
        "Ġt",
        "im"
      ],
      [
        "Ġt",
        "rain"
      ],
      [
        "er",
        "ic"
      ],
      [
        "er",
        "ve"
      ],
      [
        "in",
        "al"
      ],
      [
        "on",
        "ing"
      ],
      [
        "on",
        "cis"
      ],
      [
        "te",
        "nc"
      ],
      [
        "Ġan",
        "swer"
      ],
      [
        "Ġp",
        "lu"
      ],
      [
        "Ġp",
        "res"
      ],
      [
        "Ġr",
        "em"
      ],
      [
        "Ġr",
        "eas"
      ],
      [
        "Ġs",
        "ho"
      ],
      [
        "Ġs",
        "en"
      ],
      [
        "an",
        "y"
      ],
      [
        "an",
        "sla"
      ],
      [
        "at",
        "h"
      ],
      [
        "ic",
        "k"
      ],
      [
        "ro",
        "wn"
      ],
      [
        "ĠA",
        "lic"
      ],
      [
        "ĠP",
        "ython"
      ],
      [
        "Ġf",
        "ox"
      ],
      [
        "Ġf",
        "unc"
      ],
      [
        "Ġf",
        "inal"
      ],
      [
        "Ġm",
        "ean"
      ],
      [
        "Ġm",
        "any"
      ],
      [
        "Ġm",
        "ath"
      ],
      [
        "pl",
        "ain"
      ],
      [
        "ur",
        "s"
      ],
      [
        "Ġ1",
        "2"
      ],
      [
        "Ġ1",
        "9"
      ],
      [
        "Ġb",
        "y"
      ],
      [
        "Ġb",
        "rown"
      ],
      [
        "Ġc",
        "ode"
      ],
      [
        "Ġc",
        "oncis"
      ],
      [
        "Ġho",
        "w"
      ],
      [
        "Ġho",
        "urs"
      ],
      [
        "Ġnum",
        "ber"
      ],
      [
        "Ġnum",
        "eric"
      ],
      [
        "Ġpro",
        "bl"
      ],
      [
        "Ġpro",
        "vide"
      ],
      [
        "Co",
        "mp"
      ],
      [
        "Re",
        "tur"
      ],
      [
        "So",
        "lve"
      ],
      [
        "Tr",
        "ansla"
      ],
      [
        "Us",
        "e"
      ],
      [
        "Wr",
        "ite"
      ],
      [
        "enc",
        "h"
      ],
      [
        "Ġin",
        "to"
      ],
      [
        "Ġwo",
        "rd"
      ],
      [
        "Ġla",
        "zy"
      ],
      [
        "ĠFr",
        "ench"
      ],
      [
        "Ġdo",
        "g"
      ],
      [
        "Ġex",
        "plain"
      ],
      [
        "Ġjum",
        "ps"
      ],
      [
        "Ġov",
        "er"
      ],
      [
        "Ġqu",
        "ick"
      ],
      [
        "Ġadd",
        "s"
      ],
      [
        "Ġappl",
        "es"
      ],
      [
        "Ġarr",
        "ives"
      ],
      [
        "Ġtim",
        "es"
      ],
      [
        "tenc",
        "e"
      ],
      [
        "Ġplu",
        "s"
      ],
      [
        "Ġpres",
        "erve"
      ],
      [
        "Ġrem",
        "ain"
      ],
      [
        "Ġreas",
        "oning"
      ],
      [
        "Ġsho",
        "rt"
      ],
      [
        "Ġsen",
        "tence"
      ],
      [
        "ĠAlic",
        "e"
      ],
      [
        "Ġfunc",
        "tion"
      ],
      [
        "Ġmean",
        "ing"
      ],
      [
        "Ġconcis",
        "e"
      ],
      [
        "Ġnumber",
        "s"
      ],
      [
        "Ġprobl",
        "em"
      ],
      [
        "Comp",
        "ute"
      ],
      [
        "Retur",
        "n"
      ],
      [
        "Transla",
        "te"
      ]
    ]
  }
}